---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.SetCommonCoverType(Autodesk.Revit.DB.Structure.RebarCoverType)
source: html/2ee45e73-2e2f-a51b-85f0-7d7fc1b0526a.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.SetCommonCoverType Method

Associate a single CoverType with all exposed faces of the host element.

## Syntax (C#)
```csharp
public void SetCommonCoverType(
	RebarCoverType coverType
)
```

## Parameters
- **coverType** (`Autodesk.Revit.DB.Structure.RebarCoverType`) - A CoverType object to be applied to all faces.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null